Hey Justin,

Thanks for the thorough response! I am reviewing the proposed solution and documentation. My question though is the crux of the issue ultimately related to the cidrsubnet function having to do a calculation with the data source read?

My reason is if the problem was just for data source dependencies (that I am nesting quite a bit as you can tell with byo variables), I would expect to see this with other resource dependency changes. For example, aws_route_table.public_rt has a reference to data.aws_internet_gateway.igw_selected.internet_gateway_id

# Create a public Route Table towards IGW. This will not be created if var.byo_ngw is set to True
resource "aws_route_table" "public_rt" {
  count  = var.byo_ngw == false ? 1 : 0
  vpc_id = data.aws_vpc.vpc_selected.id

  route {
    cidr_block = "0.0.0.0/0"
    gateway_id = data.aws_internet_gateway.igw_selected.internet_gateway_id
  }

  tags = merge(var.global_tags,
    { Name = "${var.name_prefix}-public-rt-${var.resource_tag}" }
  )
}

I have the same logic for aws_internet_gateway resource/data source

# Create an Internet Gateway
resource "aws_internet_gateway" "igw" {
  count  = var.byo_igw == false ? 1 : 0
  vpc_id = data.aws_vpc.vpc_selected.id

  tags = merge(var.global_tags,
    { Name = "${var.name_prefix}-igw-2${var.resource_tag}" }
  )
}

# Or reference an existing Internet Gateway
data "aws_internet_gateway" "igw_selected" {
  internet_gateway_id = var.byo_igw == false ? aws_internet_gateway.igw[0].id : var.byo_igw_id
}


If I make the same tag change to aws_internet_gateway_igw it has no affect on the aws_route_table resource that is dependent on it??



tls_private_key.key: Refreshing state... [id=0147c38e124f57d49fb8413622870c6ff1914d6e]
random_string.suffix: Refreshing state... [id=eqj1xyeo]
local_file.private_key: Refreshing state... [id=029221887f10e29a38cc89673c85f499f6ade151]
module.bastion.data.aws_ssm_parameter.amazon_linux_latest: Reading...
module.network.data.aws_availability_zones.available: Reading...
aws_key_pair.deployer: Refreshing state... [id=zsdemo-key-eqj1xyeo]
module.bastion.data.aws_iam_policy_document.bastion_instance_assume_role_policy: Reading...
module.workload.data.aws_ssm_parameter.amazon_linux_latest: Reading...
module.network.aws_vpc.vpc[0]: Refreshing state... [id=vpc-0de6415e1a5f3affa]
module.workload.aws_iam_role.node_iam_role: Refreshing state... [id=zsdemo-workload-node-iam-role-eqj1xyeo]
module.bastion.data.aws_iam_policy_document.bastion_instance_assume_role_policy: Read complete after 0s [id=1903849331]
module.bastion.aws_iam_role.bastion_iam_role: Refreshing state... [id=zsdemo-bastion-iam-role-eqj1xyeo]
module.bastion.data.aws_ssm_parameter.amazon_linux_latest: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
module.workload.data.aws_ssm_parameter.amazon_linux_latest: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
module.network.data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
module.bastion.aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=zsdemo-bastion-iam-role-eqj1xyeo-20230124162102177700000002]
module.workload.aws_iam_instance_profile.server_host_profile: Refreshing state... [id=zsdemo-workload-server_host_profile-eqj1xyeo]
module.bastion.aws_iam_instance_profile.bastion_host_profile: Refreshing state... [id=zsdemo-bastion-host-profile-eqj1xyeo]
module.workload.aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=zsdemo-workload-node-iam-role-eqj1xyeo-20230124162102174100000001]
module.network.data.aws_vpc.vpc_selected: Reading...
module.network.data.aws_vpc.vpc_selected: Read complete after 1s [id=vpc-0de6415e1a5f3affa]
module.network.aws_subnet.cc_subnet[0]: Refreshing state... [id=subnet-0d15cf232a7f26835]
module.network.aws_internet_gateway.igw[0]: Refreshing state... [id=igw-02ffae0dfbdffd27c]
module.network.aws_subnet.cc_subnet[1]: Refreshing state... [id=subnet-07eb36c328a541179]
module.workload.data.aws_vpc.selected: Reading...
module.bastion.data.aws_vpc.selected: Reading...
module.network.aws_route_table.public_rt[0]: Refreshing state... [id=rtb-062975b9fcadf51f4]
module.network.data.aws_subnet.cc_subnet_selected[0]: Reading...
module.network.data.aws_subnet.cc_subnet_selected[1]: Reading...
module.network.aws_subnet.workload_subnet[1]: Refreshing state... [id=subnet-06d5e75fb7a7a8e7c]
module.network.aws_subnet.workload_subnet[0]: Refreshing state... [id=subnet-04e2c3bd161fbdf22]
module.network.data.aws_subnet.cc_subnet_selected[0]: Read complete after 0s [id=subnet-0d15cf232a7f26835]
module.network.data.aws_subnet.cc_subnet_selected[1]: Read complete after 0s [id=subnet-07eb36c328a541179]
module.network.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-06308508bc2a838ad]
module.network.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0a91bd98c879d1096]
module.network.aws_route_table_association.public_rt_association[0]: Refreshing state... [id=rtbassoc-0154f0870e2e8e968]
module.network.aws_route_table_association.public_rt_association[1]: Refreshing state... [id=rtbassoc-0bea8a9d9bd991084]
module.network.aws_eip.eip[0]: Refreshing state... [id=eipalloc-07f12d82057638146]
module.network.aws_eip.eip[1]: Refreshing state... [id=eipalloc-073247bf93ede6f03]
module.workload.data.aws_vpc.selected: Read complete after 0s [id=vpc-0de6415e1a5f3affa]
module.workload.aws_security_group.node_sg: Refreshing state... [id=sg-0f2b65e569fd23e50]
module.bastion.data.aws_vpc.selected: Read complete after 0s [id=vpc-0de6415e1a5f3affa]
module.bastion.aws_security_group.bastion: Refreshing state... [id=sg-097e7b46116f053d4]
module.network.aws_nat_gateway.ngw[1]: Refreshing state... [id=nat-0d5cff814d50f1cbf]
module.network.aws_nat_gateway.ngw[0]: Refreshing state... [id=nat-0532b50d00879dec1]
module.workload.aws_security_group_rule.server_node_ingress_ssh: Refreshing state... [id=sgrule-538914733]
module.workload.aws_security_group_rule.server_node_ingress_self: Refreshing state... [id=sgrule-1602949026]
module.workload.aws_instance.server_host[0]: Refreshing state... [id=i-0123ceac0dba1feda]
module.bastion.aws_security_group_rule.intranet: Refreshing state... [id=sgrule-187949088]
module.bastion.aws_instance.bastion: Refreshing state... [id=i-00fc25d1afc8eb1a5]
module.bastion.aws_security_group_rule.internet: Refreshing state... [id=sgrule-163205829]
module.bastion.aws_security_group_rule.ssh: Refreshing state... [id=sgrule-2097478177]
module.network.data.aws_nat_gateway.ngw_selected[1]: Reading...
module.network.data.aws_nat_gateway.ngw_selected[0]: Reading...
module.network.data.aws_nat_gateway.ngw_selected[1]: Read complete after 0s [id=nat-0d5cff814d50f1cbf]
module.network.data.aws_nat_gateway.ngw_selected[0]: Read complete after 0s [id=nat-0532b50d00879dec1]
module.network.aws_route_table.workload_rt[0]: Refreshing state... [id=rtb-0d1c508556a947e0f]
module.network.aws_route_table.workload_rt[1]: Refreshing state... [id=rtb-0fd5183564dc6c247]
module.network.aws_route_table.cc_rt[1]: Refreshing state... [id=rtb-002efdf828d4de751]
module.network.aws_route_table.cc_rt[0]: Refreshing state... [id=rtb-08f64939b834b538c]
module.network.aws_route_table_association.workload_rt_association[0]: Refreshing state... [id=rtbassoc-0786441f6ea526a58]
module.network.aws_route_table_association.workload_rt_association[1]: Refreshing state... [id=rtbassoc-011f4b77a8868a118]
module.network.aws_route_table_association.cc_rt_asssociation[1]: Refreshing state... [id=rtbassoc-0e391740b09a7fb47]
module.network.aws_route_table_association.cc_rt_asssociation[0]: Refreshing state... [id=rtbassoc-012e0ee61327d1c1e]
local_file.testbed: Refreshing state... [id=2f11cf814601073371dbb98fd2777e017aaa3c07]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.network.data.aws_internet_gateway.igw_selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_internet_gateway" "igw_selected" {
      + arn                 = (known after apply)
      + attachments         = (known after apply)
      + id                  = (known after apply)
      + internet_gateway_id = "igw-02ffae0dfbdffd27c"
      + owner_id            = (known after apply)
      + tags                = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.network.aws_internet_gateway.igw[0] will be updated in-place
  ~ resource "aws_internet_gateway" "igw" {
        id       = "igw-02ffae0dfbdffd27c"
      ~ tags     = {
          ~ "Name"                                              = "zsdemo-igw-eqj1xyeo" -> "zsdemo-igw-2eqj1xyeo"
            # (4 unchanged elements hidden)
        }
      ~ tags_all = {
          ~ "Name"                                              = "zsdemo-igw-eqj1xyeo" -> "zsdemo-igw-2eqj1xyeo"
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.